Reports/РабочиеЧасы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>РабочиеЧасы</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/КоличествоЧасовВМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КоличествоЧасовВМесяц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РабочиеЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочииДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыходныеДни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВыходныеДни</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоРабочихЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/РабочиеЧасы/Forms/ФормаДобавитьРабочиеЧасы/Ext/Form/Module.bsl
&НаКлиенте
Перем КоличествоДнейВМесяце, НомерМесяца;

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Месяцы.Наименование КАК Наименование,
		|	Месяцы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Месяцы КАК Месяцы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяцы.Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.Элементы.Месяц.СписокВыбора.Добавить(Выборка.Ссылка,Выборка.Наименование);
	КонецЦикла;
	
	
	Если ЭтаФорма.ТекущийМесяц = Дата(1,1,1) Тогда
		ТД = ТекущаяДата();
		Если ТД <= ЭтаФорма.НачалоПериода ИЛИ ТД >= ЭтаФорма.ОкончаниеПериода Тогда
			ТД = ЭтаФорма.НачалоПериода;	
		КонецЕсли; 
		ЭтаФорма.Год = Год(ТД);
		ЭтаФорма.ТекущийМесяц = НачалоМесяца(ТД);
		ЭтаФорма.Месяц = Справочники.Месяцы.НайтиПоКоду(Месяц(ТД));
	Иначе
		ЭтаФорма.Год = Год(ЭтаФорма.ТекущийМесяц);
		ЭтаФорма.Месяц = Справочники.Месяцы.НайтиПоКоду(Месяц(ЭтаФорма.ТекущийМесяц));
	КонецЕсли; 
	
	ПолучитьКоличествоЧасов();
КонецПроцедуры

&НаСервере
Процедура ПолучитьКоличествоЧасов()
	ЭтаФорма.Элементы.Сообщение.Видимость 		= Ложь;
	ЭтаФорма.Элементы.Записать.Доступность 		= Истина;
	
	ДатаМесяца = Дата(ЭтаФорма.Год,ЭтаФорма.Месяц.Код,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоличествоЧасовВМесяц.РабочиеЧасы КАК РабочиеЧасы,
		|	КоличествоЧасовВМесяц.РабочииДни КАК РабочииДни
		|ИЗ
		|	РегистрСведений.КоличествоЧасовВМесяц КАК КоличествоЧасовВМесяц
		|ГДЕ
		|	КоличествоЧасовВМесяц.Месяц = &Месяц";
	
	Запрос.УстановитьПараметр("Месяц", ДатаМесяца);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.РабочиеЧасы 	= Выборка.РабочиеЧасы; 
		ЭтаФорма.РабочииДни 	= Выборка.РабочииДни; 
	КонецЦикла;
	
	ЗаполнитьКалендарь();
	
КонецПроцедуры // ПолучитьКоличествоЧасов()

&НаСервере
Процедура ЗаполнитьКалендарь()
	
	ДатаНачала = Дата(ЭтаФорма.Год,ЭтаФорма.Месяц.Код,1);
	ДатаОкончания = КонецМесяца(ДатаНачала);
	
	ЭтаФорма.ВыходныеДни.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыходныеДни.Дата КАК Дата,
		|	ВыходныеДни.КоличествоРабочихЧасов КАК КоличествоРабочихЧасов,
		|	ВыходныеДни.КоличествоРабочихЧасов КАК НачальноеЗначение
		|ИЗ
		|	РегистрСведений.ВыходныеДни КАК ВыходныеДни
		|ГДЕ
		|	ВыходныеДни.Дата МЕЖДУ &ДатаН И &ДатаК";
	
	Запрос.УстановитьПараметр("ДатаК", ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаН", ДатаНачала);
	
	ЭтаФорма.ВыходныеДни.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ВывестиКалендарь(ДатаНачала,ДатаОкончания);
КонецПроцедуры // ЗаполнитьКалендарь()

&НаСервере
Процедура ВывестиКалендарь(ДатаНачала,ДатаОкончания)
	ЭтаФорма.тдКалендарь.Очистить();
	
	Макет = Отчеты.РабочиеЧасы.ПолучитьМакет("Календарь");
	текОбласть = Макет.ПолучитьОбласть("ДН");
	ЭтаФорма.тдКалендарь.Вывести(текОбласть);
	текОбласть = Макет.ПолучитьОбласть("Неделя");
	
	стОтбор = Новый Структура("Дата", ); 
	ДеньНедели = 100;
	ПервоеЧисло = Истина;
	НомерКолонки = 3;
	Пока ДатаНачала < ДатаОкончания Цикл
		ДеньНедели = ДеньНедели(ДатаНачала);
		Если ПервоеЧисло Тогда
			ПервоеЧисло = Ложь;
			Если ДеньНедели > 1 Тогда
				текОбласть.Параметры.ПН = "";	
				текОбласть.Параметры.стПН = Неопределено;	
			КонецЕсли;  
			Если ДеньНедели > 2 Тогда
				текОбласть.Параметры.ВТ = "";	
				текОбласть.Параметры.стВТ = Неопределено;	
			КонецЕсли;  
			Если ДеньНедели > 3 Тогда
				текОбласть.Параметры.СР = "";	
				текОбласть.Параметры.стСР = Неопределено;	
			КонецЕсли;  
			Если ДеньНедели > 4 Тогда
				текОбласть.Параметры.ЧТ = "";	
				текОбласть.Параметры.стЧТ = Неопределено;	
			КонецЕсли;  
			Если ДеньНедели > 5 Тогда
				текОбласть.Параметры.ПТ = "";	
				текОбласть.Параметры.стПТ = Неопределено;	
			КонецЕсли;  
			Если ДеньНедели > 6 Тогда
				текОбласть.Параметры.СБ = "";	
				текОбласть.Параметры.стСБ = Неопределено;	
			КонецЕсли;  
		КонецЕсли;
		
		стОтбор.Дата = ДатаНачала;
		КоличествоРабочихЧасов = ПолучитьРабочиеЧасы(стОтбор);
		ПредставлениеДаты = Строка(День(ДатаНачала)) + " (" + КоличествоРабочихЧасов + ")";
		Расшифровка = Новый Структура("Дата,КоличествоРабочихЧасов,Тип",ДатаНачала,КоличествоРабочихЧасов,"КоличествоЧасов");
		Если ДеньНедели = 1 Тогда
			текОбласть.Параметры.ПН = ПредставлениеДаты;	
			текОбласть.Параметры.стПН = Расшифровка;
		ИначеЕсли ДеньНедели = 2 Тогда
			текОбласть.Параметры.ВТ = ПредставлениеДаты;	
			текОбласть.Параметры.стВТ = Расшифровка;
		ИначеЕсли ДеньНедели = 3 Тогда
			текОбласть.Параметры.СР = ПредставлениеДаты;	
			текОбласть.Параметры.стСР = Расшифровка;
		ИначеЕсли ДеньНедели = 4 Тогда
			текОбласть.Параметры.ЧТ = ПредставлениеДаты;	
			текОбласть.Параметры.стЧТ = Расшифровка;
		ИначеЕсли ДеньНедели = 5 Тогда
			текОбласть.Параметры.ПТ = ПредставлениеДаты;	
			текОбласть.Параметры.стПТ = Расшифровка;
		ИначеЕсли ДеньНедели = 6 Тогда
			текОбласть.Параметры.СБ = ПредставлениеДаты;	
			текОбласть.Параметры.стСБ = Расшифровка;
		ИначеЕсли ДеньНедели = 7 Тогда
			текОбласть.Параметры.ВС = ПредставлениеДаты;	
			текОбласть.Параметры.стВС = Расшифровка;
			ЭтаФорма.тдКалендарь.Присоединить(текОбласть);
			
			РаскраситьДаты(НомерКолонки);
			НомерКолонки = НомерКолонки + 1;
		КонецЕсли; 
		
		ДатаНачала = ДатаНачала + 24 * 3600;
	КонецЦикла; 
	
	Если ДеньНедели < 7 Тогда
		текОбласть.Параметры.ВС = "";	
		текОбласть.Параметры.стВС = Неопределено;	
		Если ДеньНедели < 6 Тогда
			текОбласть.Параметры.СБ = "";	
			текОбласть.Параметры.стСБ = Неопределено;	
		КонецЕсли;  
		Если ДеньНедели < 5 Тогда
			текОбласть.Параметры.ПТ = "";	
			текОбласть.Параметры.стПТ = Неопределено;	
		КонецЕсли;  
		Если ДеньНедели < 4 Тогда
			текОбласть.Параметры.ЧТ = "";	
			текОбласть.Параметры.стЧТ = Неопределено;	
		КонецЕсли;  
		Если ДеньНедели < 3 Тогда
			текОбласть.Параметры.СР = "";	
			текОбласть.Параметры.стСР = Неопределено;	
		КонецЕсли;  
		Если ДеньНедели < 2 Тогда
			текОбласть.Параметры.ВТ = "";	
			текОбласть.Параметры.стВТ = Неопределено;	
		КонецЕсли;  
		ЭтаФорма.тдКалендарь.Присоединить(текОбласть);
		РаскраситьДаты(НомерКолонки);
	КонецЕсли; 
КонецПроцедуры // ВывестиКалендарь()

Процедура РаскраситьДаты(НомерКолонки)
	Для х = 2 По 8 Цикл
		текОбластьЦвет = ЭтаФорма.тдКалендарь.Область("R" + х + "C" + НомерКолонки);
		Если текОбластьЦвет.Расшифровка = Неопределено Тогда
			КоличествоРабочихЧасов = 0;	
		Иначе
			КоличествоРабочихЧасов = текОбластьЦвет.Расшифровка.КоличествоРабочихЧасов;
		КонецЕсли; 
		Если КоличествоРабочихЧасов >= 8 Тогда
			ЦветТекста = Новый Цвет(0,0,0);
		ИначеЕсли КоличествоРабочихЧасов = 0 Тогда
			ЦветТекста = Новый Цвет(255,0,0);
		Иначе
			ЦветТекста = Новый Цвет(0,0,255);
		КонецЕсли;
		текОбластьЦвет.ЦветТекста = ЦветТекста;
	КонецЦикла;  
КонецПроцедуры // РаскраситьДаты()
 
&НаСервере
Функция ПолучитьРабочиеЧасы(стОтбор)
	НайденыеСтроки = ЭтаФорма.ВыходныеДни.НайтиСтроки(стОтбор);
	Если НайденыеСтроки.Количество() > 0 Тогда
		Возврат НайденыеСтроки[0].КоличествоРабочихЧасов;
	КонецЕсли; 
	
	Возврат 8;

КонецФункции // ПолучитьРабочиеЧасы(ДатаНачала)

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	ПолучитьКоличествоДнейВМесяце();
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	ПолучитьКоличествоЧасов();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Если ЭтаФорма.Год = 0 Тогда
		ПоказатьПредупреждение(,"Не заполнен год.");
		Возврат;
	КонецЕсли; 
	Если ЭтаФорма.Месяц = 0 Тогда
		ПоказатьПредупреждение(,"Не заполнен месяц.");
		Возврат;
	КонецЕсли; 
	ЗаписатьНаСервере();
	Оповестить("ДатаСохранена");
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	текДата = Дата(ЭтаФорма.Год,ЭтаФорма.Месяц.Код,1);
	НаборЗаписей = РегистрыСведений.КоличествоЧасовВМесяц.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Месяц.Установить(текДата);
	
	НоваяЗапись 			= НаборЗаписей.Добавить();
	НоваяЗапись.Месяц 		= текДата;
	НоваяЗапись.РабочиеЧасы = ЭтаФорма.РабочиеЧасы;
	НоваяЗапись.РабочииДни  = ЭтаФорма.РабочииДни;
	
	НаборЗаписей.Записать();
	
	Для каждого х Из ЭтаФорма.ВыходныеДни Цикл
		Если х.НачальноеЗначение = х.КоличествоРабочихЧасов И НЕ х.Удалить Тогда
			Продолжить;
		КонецЕсли; 
		НаборЗаписей = РегистрыСведений.ВыходныеДни.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Дата.Установить(х.Дата);
		Если НЕ х.Удалить Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Дата = х.Дата;
			НоваяЗапись.КоличествоРабочихЧасов = х.КоличествоРабочихЧасов;
		КонецЕсли; 
		
		НаборЗаписей.Записать();
	КонецЦикла; 

КонецПроцедуры // ЗаписатьНаСервере()

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоличествоДнейВМесяце 	= 0;
	НомерМесяца 			= 0;
	ЗаполнитьНаСервере();
	ПолучитьКоличествоДнейВМесяце();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыходныеНаСервере()
	ЭтаФорма.ВыходныеДни.Очистить();
	ДатаНачала = Дата(ЭтаФорма.Год,ЭтаФорма.Месяц.Код,1);
	ДатаОкончания = КонецМесяца(ДатаНачала);
	Пока ДатаНачала < ДатаОкончания Цикл
	    Если ДеньНедели(ДатаНачала) > 5 Тогда
			НС = ЭтаФорма.ВыходныеДни.Добавить();
			НС.Дата = ДатаНачала;
		    НС.КоличествоРабочихЧасов = 0;
			НС.НачальноеЗначение = -1;
		КонецЕсли; 
		
	    ДатаНачала = ДатаНачала + 24 * 3600;
	КонецЦикла; 
	
	ВывестиКалендарь(Дата(ЭтаФорма.Год,ЭтаФорма.Месяц.Код,1),ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЧасы(Команда)
	ЗаполнитьВыходныеНаСервере();
	РасчитатьКоличествоДнейЧасов();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура тдКалендарьОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если Тип("Структура") = ТипЗнч(Расшифровка) Тогда
		
		СтандартнаяОбработка = Ложь;		
		Если Расшифровка.Тип = "КоличествоЧасов" Тогда
			ПоказатьВводЧисла(Новый ОписаниеОповещения("ПослеВводаЧасов",ЭтаФорма
			,Новый Структура("ТекущаяОбласть",Элемент.ТекущаяОбласть.Имя)),Расшифровка.КоличествоРабочихЧасов,"Рабочие часы",2,0);
		КонецЕсли; 		 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЧасов(РабочиеЧасы, Параметры) Экспорт
    Если РабочиеЧасы = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Если РабочиеЧасы > 24 ИЛИ РабочиеЧасы < 0 Тогда
		РабочиеЧасы = 0;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	ПолучитьОбласть(Параметры.ТекущаяОбласть,РабочиеЧасы);
	РасчитатьКоличествоДнейЧасов();
КонецПроцедуры

&НаСервере
Процедура ПолучитьОбласть(ИмяТекущаяОбласть,РабочиеЧасы)
	текОбласть = ЭтаФорма.тдКалендарь.Область(ИмяТекущаяОбласть);
	Если РабочиеЧасы >= 8 Тогда
		текОбласть.ЦветТекста = Новый Цвет(0,0,0);
	ИначеЕсли РабочиеЧасы = 0 Тогда
		текОбласть.ЦветТекста = Новый Цвет(255,0,0);
	Иначе
		текОбласть.ЦветТекста = Новый Цвет(0,0,255);
	КонецЕсли; 
	текОбласть.Расшифровка.КоличествоРабочихЧасов = РабочиеЧасы;
	текОбласть.Текст = Строка(День(текОбласть.Расшифровка.Дата)) + " (" + РабочиеЧасы + ")";
	стОтбора = Новый Структура("Дата",текОбласть.Расшифровка.Дата); 
	НайденыеСтроки = ЭтаФорма.ВыходныеДни.НайтиСтроки(стОтбора);
	Если НайденыеСтроки.Количество() = 0 Тогда
		Если РабочиеЧасы >= 8 Тогда
			Возврат;
		КонецЕсли;  
		НС = ЭтаФорма.ВыходныеДни.Добавить();
		НС.Дата = текОбласть.Расшифровка.Дата;
		НС.КоличествоРабочихЧасов = РабочиеЧасы;
		НС.НачальноеЗначение = -1;
	Иначе
		Если РабочиеЧасы < 8 Тогда
			НайденыеСтроки[0].КоличествоРабочихЧасов = РабочиеЧасы;
			НайденыеСтроки[0].Удалить = Ложь;
		Иначе
			НайденыеСтроки[0].Удалить = Истина;
		КонецЕсли;  
	КонецЕсли;
	
КонецПроцедуры // ПолучитьОбласть()

&НаКлиенте
Процедура РасчитатьКоличествоДнейЧасов()
	ЭтаФорма.РабочиеЧасы 	= 0;
	ЭтаФорма.РабочииДни 	= 0;
	
	Если НомерМесяца = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для текДень = 1 По КоличествоДнейВМесяце  Цикл
		текДата = Дата(ЭтаФорма.Год, НомерМесяца, текДень);
		
		КоличествоРабочихЧасов = 8;
		
		Для каждого текВыходной Из ЭтаФорма.ВыходныеДни Цикл
			Если текВыходной.Дата = текДата Тогда
				Если НЕ текВыходной.Удалить Тогда
					КоличествоРабочихЧасов = текВыходной.КоличествоРабочихЧасов;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если КоличествоРабочихЧасов  > 0 Тогда
			ЭтаФорма.РабочиеЧасы 	= ЭтаФорма.РабочиеЧасы 	+ КоличествоРабочихЧасов; 
			ЭтаФорма.РабочииДни 	= ЭтаФорма.РабочииДни 	+ 1; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // РасчитатьКоличествоДнейЧасов()

&НаКлиенте
Процедура МесяцРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЭтаФорма.Месяц = омМесяц.МесяцРегулированиеНаСервере(ЭтаФорма.Месяц,Направление);
	ПолучитьКоличествоДнейВМесяце();
КонецПроцедуры 

&НаКлиенте
Процедура ПолучитьКоличествоДнейВМесяце()

	Если ЗначениеЗаполнено(ЭтаФорма.Месяц) И ЭтаФорма.Год > 0 Тогда
		КоличествоДнейВМесяце = омМесяц.КоличествоДнейВМесяце(ЭтаФорма.Месяц, ЭтаФорма.Год, НомерМесяца);
	Иначе
		КоличествоДнейВМесяце = 0;
	КонецЕсли;
	ПолучитьКоличествоЧасов();
КонецПроцедуры // ПолучитьКоличествоДнейВМесяце()
